<a href="https://colab.research.google.com/github/SaCosta-pckt/TitanicPandas/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Autor: Sabrina Silva da Costa

Linkedin: https://www.linkedin.com/in/sabrina-costa-8287a0178/ 

Feito durante as aulas de introdução a Ciência de Dados da Digital Innovation One

#Dados do Titanic
https://www.kaggle.com/c/titanic/data?select=train.csv

#Importação de Pacotes

In [ ]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

#Leitura do Banco de Dados

Passando conteúdo do arquivo para uma variável:

In [7]:
dados = pd.read_csv('/content/train (1).csv')

Lendo as 5 primeiras linhas do banco:

In [8]:
dados.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

#Tirando informações desnecesárias do Banco

Removendo colunas desnecessárias para a análise dos dados:

In [9]:
dados = dados.drop(['Name','Ticket','Cabin','Embarked'], axis=1)

Observação sobre a função drop: 
*   axis = 1 para remover as colunas
*   axis = 0 para linhas

In [10]:
dados.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0            1         0       3    male  22.0      1      0   7.2500
1            2         1       1  female  38.0      1      0  71.2833
2            3         1       3  female  26.0      0      0   7.9250
3            4         1       1  female  35.0      1      0  53.1000
4            5         0       3    male  35.0      0      0   8.0500

#Editando chave e variável de resposta

Definindo o ID do passageiro como chave primária do banco e renomeando a coluna 'Suvived' por 'target', pois será o nosso principal alvo nas estimativas.

In [11]:
dados = dados.set_index('PassengerId') 
dados = dados.rename(columns = {'Survived' : 'target'}, inplace = False)

In [ ]:
dados.head()

             target  Pclass     Sex   Age  SibSp  Parch     Fare
PassengerId
1                 0       3    male  22.0      1      0   7.2500
2                 1       1  female  38.0      1      0  71.2833
3                 1       3  female  26.0      0      0   7.9250
4                 1       1  female  35.0      1      0  53.1000
5                 0       3    male  35.0      0      0   8.0500

#Descritiva

 Aplicando algumas funções estatísticas nos dados numéricos do banco:

In [ ]:
dados.describe()

           target      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

Aplicando algumas funções estatísticas nos dados strings do banco:

In [ ]:
dados.describe(include=['O'])

         Sex
count    891
unique     2
top     male
freq     577

#Transformação dos dados

Criando colunas novas em um formato diferente, usando 1 e 0 para indicar a ocorrência, ou não, de uma característica, uma espécie de flag:

In [12]:
dados['Sex_F'] = np.where(dados['Sex'] == 'female', 1, 0)

dados['Pclass_1'] = np.where(dados['Pclass'] == 1, 1, 0)
dados['Pclass_2'] = np.where(dados['Pclass'] == 2, 1, 0)
dados['Pclass_3'] = np.where(dados['Pclass'] == 3, 1, 0)

#existem pacotes que fazem isso de forma mais automática

Como agora foram criadas novas colunas para substituir outras, pode-se excluir as colunas antigas, agora desnecessárias:

In [13]:
dados = dados.drop(['Pclass','Sex'], axis = 1)

In [ ]:
dados.head()

             target   Age  SibSp  Parch  ...  Sex_F  Pclass_1  Pclass_2  Pclass_3
PassengerId                              ...
1                 0  22.0      1      0  ...      0         0         0         1
2                 1  38.0      1      0  ...      1         1         0         0
3                 1  26.0      0      0  ...      1         0         0         1
4                 1  35.0      1      0  ...      1         1         0         0
5                 0  35.0      0      0  ...      0         0         0         1

[5 rows x 9 columns]

Visualizando quantidade de dados faltando (is missing):

In [14]:
dados.isnull().sum()

target        0
Age         177
SibSp         0
Parch         0
Fare          0
Sex_F         0
Pclass_1      0
Pclass_2      0
Pclass_3      0
dtype: int64

Substituindo dados faltando (células nulas) por 0:

In [15]:
dados.fillna(0, inplace= True)

Agora não restam mais células nulas:

In [16]:
dados.isnull().sum()

target      0
Age         0
SibSp       0
Parch       0
Fare        0
Sex_F       0
Pclass_1    0
Pclass_2    0
Pclass_3    0
dtype: int64

#Amostragem

*  Usando 70% para treinar o modelo e 30% para testar

In [19]:
x_train, x_test, y_train, y_test = train_test_split(dados.drop(['target'], axis = 1), 
                                                    dados['target'], 
                                                    test_size = 0.3, 
                                                    random_state = 1234)
[
{'treino': x_train.shape},
{'teste': x_test.shape}
]

[{'treino': (623, 8)}, {'teste': (268, 8)}]

#Modelo

*   Usando Random Forest

In [20]:
rndforest = RandomForestClassifier(n_estimators = 1000,
                                   criterion = 'gini',
                                   max_depth = 5)
rndforest.fit(x_train, y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=5, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [21]:
probabilidade = rndforest.predict_proba(dados.drop('target', axis = 1))[:,1]

In [22]:
dados['probabilidade'] = probabilidade

Na coluna de probabilidades o algoritmo estima a probabilidade de sobrevivência do passageiro:

In [23]:
dados

             target   Age  SibSp  ...  Pclass_2  Pclass_3  probabilidade
PassengerId                       ...
1                 0  22.0      1  ...         0         1       0.120966
2                 1  38.0      1  ...         0         0       0.936380
3                 1  26.0      0  ...         0         1       0.440349
4                 1  35.0      1  ...         0         0       0.920138
5                 0  35.0      0  ...         0         1       0.143019
...             ...   ...    ...  ...       ...       ...            ...
887               0  27.0      0  ...         1         0       0.128466
888               1  19.0      0  ...         0         0       0.850552
889               0   0.0      1  ...         0         1       0.498406
890               1  26.0      0  ...         0         0       0.451613
891               0  32.0      0  ...         0         1       0.161351

[891 rows x 10 columns]